#Область ПрограммныйИнтерфейс

Процедура ОтразитьДвижениеАкцизныхМарок_питДанныеПродажФронта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ДокументыДляПроведения
		|ИЗ
		|	РегистрСведений.MRS_питДанныеПродажФронта_УчетАлкоголя КАК MRS_питДанныеПродажФронта_УчетАлкоголя
		|ГДЕ
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.Обработано = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование КАК ДокументОснование,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.КодАкциза КАК КодАкциза,
		|	СУММА(MRS_питДанныеПродажФронта_УчетАлкоголя.Количество) КАК Количество,
		|	СУММА(MRS_питДанныеПродажФронта_УчетАлкоголя.КоличествоИспользовано) КАК КоличествоИспользовано,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	ДокументыДляПроведения КАК ДокументыДляПроведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MRS_питДанныеПродажФронта_УчетАлкоголя КАК MRS_питДанныеПродажФронта_УчетАлкоголя
		|		ПО ДокументыДляПроведения.ДокументОснование = MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.КодАкциза,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ОрганизацияЕГАИС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокументов.ДокументОснование КАК ДокументОснование,
		|	ДанныеДокументов.КодАкциза КАК КодАкциза,
		|	ДанныеДокументов.Количество КАК Количество,
		|	ДанныеДокументов.КоличествоИспользовано КАК КоличествоИспользовано,
		|	АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	АкцизныеМаркиЕГАИС.АкцизнаяМарка КАК АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.Справка2 КАК Справка2,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	АкцизныеМаркиЕГАИС.Основание КАК Основание,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция.Объем * 1000 КАК АлкогольнаяПродукцияОбъем,
		|	ДанныеДокументов.ОрганизацияЕГАИС КАК ОрганизацияЕГАИСДокумента
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|		ПО ДанныеДокументов.КодАкциза = АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода
		|			И (ВЫБОР
		|				КОГДА ДанныеДокументов.ОрганизацияЕГАИС <> ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)
		|					ТОГДА ДанныеДокументов.ОрганизацияЕГАИС = АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснование
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(КоличествоИспользовано)
		|ПО
		|	ДокументОснование,
		|	КодАкциза";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументОснование = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументОснование.Следующий() Цикл 
		
		НачатьТранзакцию();
		
		Попытка
			ОтразитьДвижениеАкцизныхМарокПоДокументу(ВыборкаДокументОснование);
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
			КонецЕсли;
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура MRS_ВыполнениеРегламентныхДействийЕГАИС() Экспорт
	
	ОтразитьДвижениеАкцизныхМарок_питДанныеПродажФронта();
	
КонецПроцедуры

Процедура ОтразитьДвижениеMRS_питДанныеПродажФронта_УчетАлкоголя(ДокументОснование, ТаблицаСписанныхБутылок, КодАкциза)
	
	НаборЗаписей = РегистрыСведений.MRS_питДанныеПродажФронта_УчетАлкоголя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КодАкциза.Установить(КодАкциза);
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	НаборЗаписей.Прочитать();
	ТзНаборЗаписей = НаборЗаписей.Выгрузить();
	ТзНаборЗаписей.Очистить();
	
	Для Каждого ТекСтрокаЗаписи Из ТаблицаСписанныхБутылок Цикл 
		Если ТекСтрокаЗаписи.Количество = 0 И ТекСтрокаЗаписи.КоличествоИспользовано = 0 Тогда
		    Продолжить;		
		КонецЕсли;
		
		НоваяСтрока = ТзНаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗаписи);
		НоваяСтрока.ДокументОснование = ДокументОснование;
		НоваяСтрока.Обработано = Истина;
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТзНаборЗаписей);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьДвижениеАкцизныхМарокПоДокументу(ВыборкаДокументОснование)
	
	ТаблицаСписанияСправки2 = Новый ТаблицаЗначений;
	ТаблицаСписанияСправки2.Колонки.Добавить("ОрганизацияЕГАИС");
	ТаблицаСписанияСправки2.Колонки.Добавить("АлкогольнаяПродукция");
	ТаблицаСписанияСправки2.Колонки.Добавить("Справка2");
	ТаблицаСписанияСправки2.Колонки.Добавить("КоличествоБутылок");
	
	ВыборкаДетальныеЗаписи = ВыборкаДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаСписанныхБутылок = Новый ТаблицаЗначений;
	ТаблицаСписанныхБутылок.Колонки.Добавить("КодАкциза", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаСписанныхБутылок.Колонки.Добавить("ОрганизацияЕГАИС", Новый ОписаниеТипов("СправочникСсылка.КлассификаторОрганизацийЕГАИС"));
	ТаблицаСписанныхБутылок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 5)));
	ТаблицаСписанныхБутылок.Колонки.Добавить("КоличествоИспользовано", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 5)));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл       
		
		ТаблицаСписанныхБутылок.Очистить();
		
		ВыборкаДетальныеЗаписиАкцизныеМарки = ВыборкаДетальныеЗаписи.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиАкцизныеМарки.Следующий() Цикл  
			
			КоличествоДвижения = ВыборкаДетальныеЗаписиАкцизныеМарки.Количество - ВыборкаДетальныеЗаписиАкцизныеМарки.КоличествоИспользовано; 
			
			НаборЗаписей = РегистрыСведений.АкцизныеМаркиЕГАИС.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ОрганизацияЕГАИС.Установить(ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС);
			НаборЗаписей.Отбор.АкцизнаяМарка.Установить(ВыборкаДетальныеЗаписиАкцизныеМарки.АкцизнаяМарка);
			НаборЗаписей.Прочитать();   
			ТекущийСтатус = НаборЗаписей[0].Статус;  
			
			Если (ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВНаличии ИЛИ ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка)
					И НаборЗаписей[0].КоличествоЧастичногоВыбытия = 0 Тогда 
				КоличествоЧастичногоВыбытия = ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукцияОбъем;
			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка Тогда
				КоличествоЧастичногоВыбытия = НаборЗаписей[0].КоличествоЧастичногоВыбытия;
			Иначе
				КоличествоЧастичногоВыбытия = 0;
			КонецЕсли;

			Если КоличествоДвижения > КоличествоЧастичногоВыбытия Тогда
				КоличествоДвижения = КоличествоЧастичногоВыбытия;
			КонецЕсли;      
			
			ТекСтрокаСписаннойБутылки = ТаблицаСписанныхБутылок.Добавить();
			ТекСтрокаСписаннойБутылки.КодАкциза = ВыборкаДетальныеЗаписиАкцизныеМарки.КодАкциза;
			ТекСтрокаСписаннойБутылки.ОрганизацияЕГАИС = ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС;
			ТекСтрокаСписаннойБутылки.Количество = ВыборкаДетальныеЗаписиАкцизныеМарки.Количество;
			ТекСтрокаСписаннойБутылки.КоличествоИспользовано = ВыборкаДетальныеЗаписиАкцизныеМарки.КоличествоИспользовано + КоличествоДвижения;
			
			ПредыдущийСтатус = НаборЗаписей[0].Статус;
			НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка;  
			
			НаборЗаписей[0].КоличествоЧастичногоВыбытия = КоличествоЧастичногоВыбытия - КоличествоДвижения; 
			
			Если НаборЗаписей[0].КоличествоЧастичногоВыбытия <= 0 Тогда
				// << MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
				//НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Отсутствует;
				НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Реализована;
				// >> MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
			ИначеЕсли НаборЗаписей[0].КоличествоЧастичногоВыбытия = ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукцияОбъем Тогда 
				НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.ВНаличии;
				НаборЗаписей[0].КоличествоЧастичногоВыбытия = 0;
			КонецЕсли;
			
			НаборЗаписей.Записать();     
			
			Если СтатусМаркиТребуетОтражения(НаборЗаписей[0].Статус, ПредыдущийСтатус) Тогда    
				
				НоваяСтрокаСписанияСправки2 = ТаблицаСписанияСправки2.Добавить();
				НоваяСтрокаСписанияСправки2.ОрганизацияЕГАИС 		= ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС;
				НоваяСтрокаСписанияСправки2.АлкогольнаяПродукция 	= ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукция;
				НоваяСтрокаСписанияСправки2.Справка2 				= ВыборкаДетальныеЗаписиАкцизныеМарки.Справка2;  
				
				// << MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
				//Если НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Отсутствует Тогда
				Если НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Отсутствует 
						ИЛИ НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Реализована  Тогда                                                         
				// >> MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
					НоваяСтрокаСписанияСправки2.КоличествоБутылок 		= -1;
				Иначе
					НоваяСтрокаСписанияСправки2.КоличествоБутылок 		= 1;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;  
		
		ОтразитьДвижениеMRS_питДанныеПродажФронта_УчетАлкоголя(ВыборкаДокументОснование.ДокументОснование, ТаблицаСписанныхБутылок, ВыборкаДетальныеЗаписи.КодАкциза);
		
	КонецЦикла;
	
	ОтразитьДвижениеСправок2(ВыборкаДокументОснование.ДокументОснование, ТаблицаСписанияСправки2);
	
КонецПроцедуры

Процедура ОтразитьДвижениеСправок2(ДокументОснование, ТаблицаСписанияСправки2)
	
	ТаблицаСписанияСправки2.Свернуть("ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2", "КоличествоБутылок");
	Если ТаблицаСписанияСправки2.Итог("КоличествоБутылок") <> 0 Тогда
		
		ДокОбъект = ДокументОснование.ПолучитьОбъект();
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС = ДокОбъект.Движения.ОстаткиАлкогольнойПродукцииЕГАИС;
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Прочитать();
		
		Для Каждого ТекСтрокаСписанияСправки2 Из ТаблицаСписанияСправки2 Цикл 
			
			НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС = ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС, ТекСтрокаСписанияСправки2);
			
			НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Период = ДокОбъект.Дата;
			Если ТекСтрокаСписанияСправки2.КоличествоБутылок > 0 Тогда
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Количество = ТекСтрокаСписанияСправки2.КоличествоБутылок;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.СвободныйОстаток = ТекСтрокаСписанияСправки2.КоличествоБутылок;
			Иначе 
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Количество = - ТекСтрокаСписанияСправки2.КоличествоБутылок;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.СвободныйОстаток = - ТекСтрокаСписанияСправки2.КоличествоБутылок;
			КонецЕсли;
			
		КонецЦикла;
		
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
