#Область ПрограммныйИнтерфейс

Процедура ОтразитьДвижениеАкцизныхМарок_питДанныеПродажФронта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование КАК ДокументОснование,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.КодАкциза КАК КодАкциза,
		|	СУММА(MRS_питДанныеПродажФронта_УчетАлкоголя.Количество) КАК Количество,
		|	СУММА(MRS_питДанныеПродажФронта_УчетАлкоголя.КоличествоИспользовано) КАК КоличествоИспользовано,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	РегистрСведений.MRS_питДанныеПродажФронта_УчетАлкоголя КАК MRS_питДанныеПродажФронта_УчетАлкоголя
		|ГДЕ
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.Обработано = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ДокументОснование,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.КодАкциза,
		|	MRS_питДанныеПродажФронта_УчетАлкоголя.ОрганизацияЕГАИС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодАкциза
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокументов.ДокументОснование КАК ДокументОснование,
		|	ДанныеДокументов.КодАкциза КАК КодАкциза,
		|	ДанныеДокументов.Количество КАК Количество,
		|	ДанныеДокументов.КоличествоИспользовано КАК КоличествоИспользовано,
		|	АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	АкцизныеМаркиЕГАИС.АкцизнаяМарка КАК АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.Справка2 КАК Справка2,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	АкцизныеМаркиЕГАИС.Основание КАК Основание,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция.Объем * 1000 КАК АлкогольнаяПродукцияОбъем,
		|	ДанныеДокументов.ОрганизацияЕГАИС КАК ОрганизацияЕГАИСДокумента
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|		ПО ДанныеДокументов.КодАкциза = АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода
		|			И ДанныеДокументов.ОрганизацияЕГАИС = АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС
		|ГДЕ
		|	ДанныеДокументов.ОрганизацияЕГАИС <> ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокументов.ДокументОснование,
		|	ДанныеДокументов.КодАкциза,
		|	ДанныеДокументов.Количество,
		|	ДанныеДокументов.КоличествоИспользовано,
		|	АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС,
		|	АкцизныеМаркиЕГАИС.АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.Справка2,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция,
		|	АкцизныеМаркиЕГАИС.Основание,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция.Объем * 1000,
		|	ДанныеДокументов.ОрганизацияЕГАИС
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|		ПО ДанныеДокументов.КодАкциза = АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода
		|ГДЕ
		|	ДанныеДокументов.ОрганизацияЕГАИС = ЗНАЧЕНИЕ(Справочник.КлассификаторОрганизацийЕГАИС.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснование
		|ИТОГИ
		|	МАКСИМУМ(Количество), // Одна строка на группу или берем максимум из возможных дублей (чтобы не умножить сумму)
		|	МАКСИМУМ(КоличествоИспользовано)
		|ПО
		|	ДокументОснование,
		|	КодАкциза";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументОснование = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументОснование.Следующий() Цикл 
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.MRS_питДанныеПродажФронта_УчетАлкоголя");
			ЭлементБлокировки.УстановитьЗначение("ДокументОснование", ВыборкаДокументОснование.ДокументОснование);
			БлокировкаДанных.Заблокировать();
			
			ОтразитьДвижениеАкцизныхМарокПоДокументу(ВыборкаДокументОснование);
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ЕГАИС. Отражение движений акцизных марок'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.MRS_питДанныеПродажФронта_УчетАлкоголя,
				ВыборкаДокументОснование.ДокументОснование,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура MRS_ВыполнениеРегламентныхДействийЕГАИС() Экспорт
	
	ОтразитьДвижениеАкцизныхМарок_питДанныеПродажФронта();
	
КонецПроцедуры

Процедура ОтразитьДвижениеMRS_питДанныеПродажФронта_УчетАлкоголя(ДокументОснование, ТаблицаСписанныхБутылок)
	
	НаборЗаписей = РегистрыСведений.MRS_питДанныеПродажФронта_УчетАлкоголя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(ДокументОснование);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНабораЗаписей = НаборЗаписей.Выгрузить();
	
	Для Каждого ТекСтрокаЗаписи Из ТаблицаСписанныхБутылок Цикл 
		Если ТекСтрокаЗаписи.Количество = 0 И ТекСтрокаЗаписи.КоличествоИспользовано = 0 Тогда
		    Продолжить;		
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура("КодАкциза, ОрганизацияЕГАИС", ТекСтрокаЗаписи.КодАкциза, ТекСтрокаЗаписи.ОрганизацияЕГАИС);
		НайденныеСтроки = ТаблицаНабораЗаписей.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаРегистра = НайденныеСтроки[0];
			СтрокаРегистра.Количество = ТекСтрокаЗаписи.Количество;
			СтрокаРегистра.КоличествоИспользовано = ТекСтрокаЗаписи.КоличествоИспользовано;
			СтрокаРегистра.Обработано = Истина;
		Иначе
			НоваяСтрока = ТаблицаНабораЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗаписи);
			НоваяСтрока.ДокументОснование = ДокументОснование;
			НоваяСтрока.Обработано = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТаблицаНабораЗаписей);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьДвижениеАкцизныхМарокПоДокументу(ВыборкаДокументОснование)
	
	ТаблицаСписанияСправки2 = Новый ТаблицаЗначений;
	ТаблицаСписанияСправки2.Колонки.Добавить("ОрганизацияЕГАИС");
	ТаблицаСписанияСправки2.Колонки.Добавить("АлкогольнаяПродукция");
	ТаблицаСписанияСправки2.Колонки.Добавить("Справка2");
	ТаблицаСписанияСправки2.Колонки.Добавить("КоличествоБутылок");
	
	ВыборкаДетальныеЗаписи = ВыборкаДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаСписанныхБутылок = Новый ТаблицаЗначений;
	ТаблицаСписанныхБутылок.Колонки.Добавить("КодАкциза", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаСписанныхБутылок.Колонки.Добавить("ОрганизацияЕГАИС", Новый ОписаниеТипов("СправочникСсылка.КлассификаторОрганизацийЕГАИС"));
	ТаблицаСписанныхБутылок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 5)));
	ТаблицаСписанныхБутылок.Колонки.Добавить("КоличествоИспользовано", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 5)));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл       
		
		ВыборкаДетальныеЗаписиАкцизныеМарки = ВыборкаДетальныеЗаписи.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиАкцизныеМарки.Следующий() Цикл  
			
			КоличествоДвижения = ВыборкаДетальныеЗаписиАкцизныеМарки.Количество - ВыборкаДетальныеЗаписиАкцизныеМарки.КоличествоИспользовано; 
			
			МенеджерЗаписи = РегистрыСведений.АкцизныеМаркиЕГАИС.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.ОрганизацияЕГАИС = ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС;
			МенеджерЗаписи.АкцизнаяМарка = ВыборкаДетальныеЗаписиАкцизныеМарки.АкцизнаяМарка;
			МенеджерЗаписи.Прочитать();   
			
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			Если КоличествоДвижения = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущийСтатус = МенеджерЗаписи.Статус;  
			
			Если (ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВНаличии ИЛИ ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка)
					И МенеджерЗаписи.КоличествоЧастичногоВыбытия = 0 Тогда 
				КоличествоЧастичногоВыбытия = ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукцияОбъем;
			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка Тогда
				КоличествоЧастичногоВыбытия = МенеджерЗаписи.КоличествоЧастичногоВыбытия;
			Иначе
				КоличествоЧастичногоВыбытия = 0;
			КонецЕсли;

			Если КоличествоДвижения > КоличествоЧастичногоВыбытия Тогда
				КоличествоДвижения = КоличествоЧастичногоВыбытия;
			КонецЕсли;      
			
			ТекСтрокаСписаннойБутылки = ТаблицаСписанныхБутылок.Добавить();
			ТекСтрокаСписаннойБутылки.КодАкциза = ВыборкаДетальныеЗаписиАкцизныеМарки.КодАкциза;
			ТекСтрокаСписаннойБутылки.ОрганизацияЕГАИС = ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС;
			ТекСтрокаСписаннойБутылки.Количество = ВыборкаДетальныеЗаписиАкцизныеМарки.Количество;
			ТекСтрокаСписаннойБутылки.КоличествоИспользовано = ВыборкаДетальныеЗаписиАкцизныеМарки.КоличествоИспользовано + КоличествоДвижения;
			
			ПредыдущийСтатус = МенеджерЗаписи.Статус;
			НовыйСтатус = Перечисления.СтатусыАкцизныхМарок.ВскрытаяБутылка;  
			
			МенеджерЗаписи.КоличествоЧастичногоВыбытия = КоличествоЧастичногоВыбытия - КоличествоДвижения; 
			
			Если МенеджерЗаписи.КоличествоЧастичногоВыбытия <= 0 Тогда
				// << MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
				//МенеджерЗаписи.Статус = Перечисления.СтатусыАкцизныхМарок.Отсутствует;
				НовыйСтатус = Перечисления.СтатусыАкцизныхМарок.Реализована;
				// >> MRS #VINE-256 ВикторовАГ <Artem.Viktorov@mriyaresort.com> 26.02.26, (Разработать отчет для контроля за учетом алкогольной продукции)
				МенеджерЗаписи.КоличествоЧастичногоВыбытия = 0;
			ИначеЕсли МенеджерЗаписи.КоличествоЧастичногоВыбытия = ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукцияОбъем Тогда 
				НовыйСтатус = Перечисления.СтатусыАкцизныхМарок.ВНаличии;
				МенеджерЗаписи.КоличествоЧастичногоВыбытия = 0;
			Иначе
				// Промежуточное частичное выбытие, статус остается ВскрытаяБутылка
			КонецЕсли;
			
			МенеджерЗаписи.Статус = НовыйСтатус;
			МенеджерЗаписи.Записать();     
			
			Если СтатусМаркиТребуетОтражения(НовыйСтатус, ПредыдущийСтатус) Тогда    
				
				НоваяСтрокаСписанияСправки2 = ТаблицаСписанияСправки2.Добавить();
				НоваяСтрокаСписанияСправки2.ОрганизацияЕГАИС 		= ВыборкаДетальныеЗаписиАкцизныеМарки.ОрганизацияЕГАИС;
				НоваяСтрокаСписанияСправки2.АлкогольнаяПродукция 	= ВыборкаДетальныеЗаписиАкцизныеМарки.АлкогольнаяПродукция;
				НоваяСтрокаСписанияСправки2.Справка2 				= ВыборкаДетальныеЗаписиАкцизныеМарки.Справка2;  
				
				Если НовыйСтатус = Перечисления.СтатусыАкцизныхМарок.Отсутствует 
						ИЛИ НовыйСтатус = Перечисления.СтатусыАкцизныхМарок.Реализована  Тогда                                                         
					НоваяСтрокаСписанияСправки2.КоличествоБутылок 		= -1;
				Иначе
					НоваяСтрокаСписанияСправки2.КоличествоБутылок 		= 1;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЦикла;
	
	ОтразитьДвижениеMRS_питДанныеПродажФронта_УчетАлкоголя(ВыборкаДокументОснование.ДокументОснование, ТаблицаСписанныхБутылок);
	
	ОтразитьДвижениеСправок2(ВыборкаДокументОснование.ДокументОснование, ТаблицаСписанияСправки2);
	
КонецПроцедуры

Процедура ОтразитьДвижениеСправок2(ДокументОснование, ТаблицаСписанияСправки2)
	
	ТаблицаСписанияСправки2.Свернуть("ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2", "КоличествоБутылок");
	Если ТаблицаСписанияСправки2.Итог("КоличествоБутылок") <> 0 Тогда
		
		ДокОбъект = ДокументОснование.ПолучитьОбъект();
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС = ДокОбъект.Движения.ОстаткиАлкогольнойПродукцииЕГАИС;
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Прочитать();
		
		Для Каждого ТекСтрокаСписанияСправки2 Из ТаблицаСписанияСправки2 Цикл 
			
			НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС = ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС, ТекСтрокаСписанияСправки2);
			
			НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Период = ДокОбъект.Дата;
			Если ТекСтрокаСписанияСправки2.КоличествоБутылок > 0 Тогда
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Количество = ТекСтрокаСписанияСправки2.КоличествоБутылок;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.СвободныйОстаток = ТекСтрокаСписанияСправки2.КоличествоБутылок;
			Иначе 
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.Количество = - ТекСтрокаСписанияСправки2.КоличествоБутылок;
				НоваяСтрокаДвиженийОстаткиАлкогольнойПродукцииЕГАС.СвободныйОстаток = - ТекСтрокаСписанияСправки2.КоличествоБутылок;
			КонецЕсли;
			
		КонецЦикла;
		
		ДвижениеДокументаОстаткиАлкогольнойПродукцииЕГАИС.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
